# Эта программ:а сравнивает два строковых значения.
# Получить от пользователя пароль.
password = input("Введите пароль: ")

# Определить, быn ли введен правильньм
# пароль.
if password == 'prospero':
    print('Пароль принят. ')
else:
    print('Извините, этот пароль неверный.')